{
  "Push Exercises": {
    "Chest": [
      {
        "name": "Push Up",
        "description": "The push-up is a bodyweight exercise that works the chest, shoulders, and triceps. It needs no equipment and can be done anywhere, with variations like incline, decline, diamond and more.",
        "how_to_do": [
          "Start in a plank position with hands under your shoulders.",
          "Keep your body straight from head to heels.",
          "Bend your elbows to lower your chest toward the floor.",
          "Push through your palms to return to the starting position."
        ],
        "reps_and_sets": "2–3 sets of 8–10 reps, increase gradually as strength improves."
      },
      {
        "name": "Bench Press",
        "description": "The bench press is a weight training exercise where you lie on a bench and push a barbell or dumbbells upward to strengthen your chest, shoulders, and arms. Variations include incline and decline bench press.",
        "how_to_do": [
          "Lie flat on a bench with feet on the floor.",
          "Hold the barbell (or dumbbells) slightly wider than shoulder-width.",
          "Lower the weight slowly to your chest.",
          "Push it back up until your arms are straight.",
          "Keep your back flat and core tight throughout."
        ],
        "reps_and_sets": "3 sets of 5–12 reps, depending on weight and form."
      },
      {
        "name": "Chest Fly",
        "description": "The chest fly isolates the chest by opening and closing the arms in a wide arc, similar to a hugging motion. Can be done with dumbbells on a bench or with cables.",
        "how_to_do": [
          "Lie on a flat bench (or stand between cables) with arms extended, elbows slightly bent.",
          "Slowly open your arms wide to stretch your chest.",
          "Bring your arms back together in front of you, keeping elbows slightly bent.",
          "Repeat with control."
        ],
        "reps_and_sets": "2–3 sets of 8–12 reps with proper form."
      }
    ],
    "Shoulders": [
      {
        "name": "Overhead Press",
        "description": "The overhead press mainly targets the shoulders and can be done standing or seated, with dumbbells or a barbell.",
        "how_to_do": [
          "Hold a barbell (or dumbbells) at shoulder height with palms facing forward.",
          "Keep your core tight and back straight.",
          "Press the weight upward until your arms are fully extended overhead.",
          "Slowly lower it back to shoulder height."
        ],
        "reps_and_sets": "3 sets of 8–12 reps with proper form."
      },
      {
        "name": "Lateral Raises",
        "description": "An isolation exercise that targets the side delts, helping build wider shoulders. Usually performed with dumbbells.",
        "how_to_do": [
          "Hold a dumbbell in each hand at your sides, palms facing inward.",
          "Slightly lean forward at the hips, keeping your back straight.",
          "With a small bend in your elbows, raise your arms out to the sides until shoulder height.",
          "Lower slowly with control."
        ],
        "reps_and_sets": "3–4 sets of 8–12 reps using light to moderate weights."
      },
      {
        "name": "Rear Delt Fly",
        "description": "Targets the rear deltoids, improving shoulder balance and posture. Can be done with dumbbells or cables.",
        "how_to_do": [
          "Hold a dumbbell in each hand, hinge forward at the hips, back straight.",
          "Let your arms hang down with a slight bend in elbows.",
          "Raise arms out to the sides until at shoulder level.",
          "Lower slowly with control."
        ],
        "reps_and_sets": "3 sets of 10–12 reps with light weights."
      }
    ],
    "Triceps": [
      {
        "name": "Dips",
        "description": "Dips target the triceps, chest, and shoulders using your body weight. Can be done on parallel bars or a bench.",
        "how_to_do": [
          "Place your hands on parallel bars or the edge of a bench.",
          "Lower your body by bending elbows until arms are at 90 degrees.",
          "Push yourself back up until arms are straight.",
          "Keep your torso upright for more tricep focus."
        ],
        "reps_and_sets": "3 sets of 8–12 reps."
      },
      {
        "name": "Overhead Triceps Extension",
        "description": "An isolation exercise for the triceps, usually done with a dumbbell or cable.",
        "how_to_do": [
          "Hold a dumbbell with both hands, raise it overhead.",
          "Keep elbows close to your head, pointing forward.",
          "Lower the dumbbell behind your head by bending elbows.",
          "Press back up to full extension."
        ],
        "reps_and_sets": "3 sets of 8–12 reps."
      },
      {
        "name": "Diamond Push Up",
        "description": "A push-up variation that emphasizes triceps by placing the hands close together under the chest.",
        "how_to_do": [
          "Start in plank position with hands forming a diamond under your chest.",
          "Lower your body, keeping elbows close to sides.",
          "Push back up to starting position.",
          "Keep core engaged and body straight."
        ],
        "reps_and_sets": "2–3 sets of 8–12 reps."
      }
    ]
  },
  "Pull Exercises": {
    "Back": [
      {
        "name": "Pull Up",
        "description": "A bodyweight exercise that strengthens the lats, upper back, and biceps.",
        "how_to_do": [
          "Hang from a bar with palms facing away (shoulder-width).",
          "Pull yourself up until your chin clears the bar.",
          "Lower slowly with control."
        ],
        "reps_and_sets": "3 sets of as many reps as possible (AMRAP)."
      },
      {
        "name": "Lat Pulldown",
        "description": "A machine exercise that targets the lats and upper back, mimicking the pull-up motion.",
        "how_to_do": [
          "Sit at a lat pulldown machine and grab the bar wider than shoulders.",
          "Pull the bar down to your chest, squeezing the lats.",
          "Slowly return the bar overhead."
        ],
        "reps_and_sets": "3 sets of 8–12 reps."
      },
      {
        "name": "Deadlift",
        "description": "A compound lift that strengthens the back, glutes, hamstrings, and core.",
        "how_to_do": [
          "Stand with feet hip-width apart, bar over mid-foot.",
          "Bend at hips and knees, grip the bar.",
          "Keep back straight and chest up as you lift the bar.",
          "Lock out at the top, then lower with control."
        ],
        "reps_and_sets": "3–4 sets of 5–8 reps with proper form."
      }
    ],
    "Biceps": [
      {
        "name": "Bicep Curl",
        "description": "The classic isolation exercise for biceps using dumbbells or a barbell.",
        "how_to_do": [
          "Hold weights at your sides, palms facing forward.",
          "Curl the weights up by bending elbows.",
          "Lower slowly back to starting position."
        ],
        "reps_and_sets": "3 sets of 10–12 reps."
      },
      {
        "name": "Hammer Curl",
        "description": "Targets both biceps and forearms with a neutral grip.",
        "how_to_do": [
          "Hold dumbbells at your sides, palms facing inward.",
          "Curl the weights upward, keeping palms facing in.",
          "Lower slowly with control."
        ],
        "reps_and_sets": "3 sets of 10–12 reps."
      },
      {
        "name": "Preacher Curl",
        "description": "Biceps isolation exercise using a preacher bench and barbell or dumbbells.",
        "how_to_do": [
          "Sit at a preacher bench with arms extended over the pad.",
          "Curl the barbell/dumbbell up towards your shoulders.",
          "Lower back down slowly with control."
        ],
        "reps_and_sets": "3 sets of 8–12 reps."
      }
    ],
    "Shoulders": [
      {
        "name": "Face Pull",
        "description": "An exercise that targets rear delts and upper traps, improving posture and shoulder health.",
        "how_to_do": [
          "Attach a rope to a cable machine at upper chest height.",
          "Grip the rope with palms facing each other.",
          "Pull the rope toward your face, elbows high.",
          "Return slowly with control."
        ],
        "reps_and_sets": "3 sets of 12–15 reps."
      },
      {
        "name": "Shrugs",
        "description": "Isolation move for the traps and upper shoulders, usually performed with dumbbells or a barbell.",
        "how_to_do": [
          "Hold dumbbells at your sides, arms straight.",
          "Lift (shrug) your shoulders as high as possible.",
          "Hold briefly, then lower slowly."
        ],
        "reps_and_sets": "3–4 sets of 10–15 reps."
      },
      {
        "name": "Upright Row",
        "description": "Targets the traps and delts, done with a barbell or dumbbells.",
        "how_to_do": [
          "Hold a barbell or dumbbells in front of your thighs, palms facing you.",
          "Pull the weight upward close to your body, leading with elbows.",
          "Lower slowly back to start."
        ],
        "reps_and_sets": "3 sets of 8–12 reps."
      }
    ]
  },
  "Leg/Core Exercises": {
    "Quads": [
      {
        "name": "Squat",
        "description": "A fundamental lower body exercise that strengthens quads, glutes, and core.",
        "how_to_do": [
          "Stand with feet shoulder-width apart.",
          "Bend knees and hips to lower into a squat, chest upright.",
          "Push back up through heels to standing."
        ],
        "reps_and_sets": "3–4 sets of 8–12 reps."
      },
      {
        "name": "Lunge",
        "description": "Targets quads and glutes, improving balance and unilateral strength.",
        "how_to_do": [
          "Step forward with one leg, lowering until both knees are 90 degrees.",
          "Push back up to standing.",
          "Alternate legs."
        ],
        "reps_and_sets": "3 sets of 8–10 reps per leg."
      },
      {
        "name": "Leg Extension",
        "description": "An isolation machine exercise targeting the quadriceps.",
        "how_to_do": [
          "Sit at a leg extension machine with pads on your shins.",
          "Extend legs fully, squeezing the quads.",
          "Lower slowly back down."
        ],
        "reps_and_sets": "3 sets of 10–12 reps."
      }
    ],
    "Hamstrings": [
      {
        "name": "Leg Curl",
        "description": "An isolation exercise for the hamstrings, usually done on a machine.",
        "how_to_do": [
          "Lie face down on a leg curl machine.",
          "Hook ankles under the pads.",
          "Curl your legs upward toward glutes.",
          "Lower slowly with control."
        ],
        "reps_and_sets": "3 sets of 10–12 reps."
      },
      {
        "name": "Hip Extension",
        "description": "Targets hamstrings and glutes through hip hinge movements.",
        "how_to_do": [
          "Stand tall and hinge forward at the hips, keeping back straight.",
          "Extend hips back up to standing.",
          "Can be weighted with a barbell (Romanian deadlift)."
        ],
        "reps_and_sets": "3 sets of 8–10 reps."
      },
      {
        "name": "Deadlift",
        "description": "A compound lift that strengthens hamstrings, glutes, back, and core.",
        "how_to_do": [
          "Stand with barbell over mid-foot, feet hip-width apart.",
          "Grip the bar and hinge at hips and knees.",
          "Lift with straight back until standing tall.",
          "Lower with control."
        ],
        "reps_and_sets": "3–4 sets of 5–8 reps."
      }
    ],
    "Glutes": [
      {
        "name": "Squat",
        "description": "Strengthens glutes, quads, and core.",
        "how_to_do": [
          "Stand with feet shoulder-width apart.",
          "Lower into a squat, chest upright.",
          "Push back up through heels."
        ],
        "reps_and_sets": "3–4 sets of 8–12 reps."
      },
      {
        "name": "Deadlift",
        "description": "Works glutes, hamstrings, back, and core.",
        "how_to_do": [
          "Stand with barbell over mid-foot.",
          "Grip bar, hinge hips, and lift while keeping chest up.",
          "Lock out at top, lower with control."
        ],
        "reps_and_sets": "3–4 sets of 5–8 reps."
      },
      {
        "name": "Hip Thrust",
        "description": "Targets the glutes directly, often weighted with a barbell.",
        "how_to_do": [
          "Sit with your upper back against a bench, feet flat on the floor.",
          "Place a barbell across your hips (optional).",
          "Drive hips upward until thighs are parallel to the floor.",
          "Lower back down with control."
        ],
        "reps_and_sets": "3 sets of 10–12 reps."
      }
    ],
    "Calves": [
      {
        "name": "Calf Raises",
        "description": "A bodyweight exercise that strengthens calf muscles.",
        "how_to_do": [
          "Stand upright, feet hip-width apart.",
          "Push through balls of feet to raise heels off the ground.",
          "Lower slowly back down."
        ],
        "reps_and_sets": "3 sets of 12–15 reps."
      },
      {
        "name": "Calf Press",
        "description": "Machine version of calf raises, usually performed on a leg press machine.",
        "how_to_do": [
          "Sit on a leg press machine with toes on the platform.",
          "Push platform by extending ankles upward.",
          "Lower slowly back down."
        ],
        "reps_and_sets": "3 sets of 12–15 reps."
      },
      {
        "name": "Weighted Calf Raises",
        "description": "Calf raises with added weight, usually dumbbells or a barbell.",
        "how_to_do": [
          "Hold dumbbells at your sides (or barbell on shoulders).",
          "Raise heels off the ground by pushing through balls of feet.",
          "Lower slowly back down."
        ],
        "reps_and_sets": "3–4 sets of 10–12 reps."
      }
    ]
  }
}
